{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip",
      "version": "2.0.0 - 2.1.0"
    },
    "claudecode.nvim": {
      "src": "https://github.com/coder/claudecode.nvim"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp"
    },
    "cmp-nvim-lsp-signature-help": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp-signature-help"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip"
    },
    "efmls-configs-nvim": {
      "src": "https://github.com/creativenull/efmls-configs-nvim"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "lspkind.nvim": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lspsaga.nvim": {
      "src": "https://github.com/glepnir/lspsaga.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "markdown-preview.nvim": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "melange-nvim": {
      "src": "https://github.com/savq/melange-nvim"
    },
    "mini.nvim": {
      "src": "https://github.com/nvim-mini/mini.nvim"
    },
    "neo-tree.nvim": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim",
      "version": "3.0.0 - 4.0.0"
    },
    "nightfox.nvim": {
      "src": "https://github.com/EdenEast/nightfox.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}
